In [1]:
import numpy as np
import pandas as pd

In [2]:
sozlukVerisi ={"istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   istanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna() # satır

   istanbul  Ankara  İzmir
0      30.0    20.0     40

In [5]:
 havaDurumuDataFrame.dropna(axis=1) # axis  = 1 sütun

   İzmir
0     40
1     39
2     38

In [6]:
yeniSozlukVerisi ={"istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniHavaDurumuDataFrame = pd.DataFrame(yeniSozlukVerisi)

In [7]:
yeniHavaDurumuDataFrame

   istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [28]:
yeniHavaDurumuDataFrame.dropna(axis = 1, thresh=2)

   istanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [29]:
yeniHavaDurumuDataFrame.fillna(20)

   istanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [34]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan ismi" : ["Ahmet","Mehmet","Doğukan","Burak","Zeynep","Fatma"],
               "Maas":[100,150,200,250,300,225]
              }

In [35]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [36]:
maasDataFrame

   Departman Calisan ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama      Doğukan   200
3  Pazarlama        Burak   250
4      Hukuk       Zeynep   300
5      Hukuk        Fatma   225

In [45]:
groupObject = maasDataFrame.groupby("Departman")

In [54]:
groupObject.count()

           Calisan ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [55]:
groupObject.mean("Maas")

            Maas
Departman
Hukuk      262.5
Pazarlama  225.0
Yazılım    125.0

In [56]:
groupObject.min()

          Calisan ismi  Maas
Departman
Hukuk            Fatma   225
Pazarlama        Burak   200
Yazılım          Ahmet   100

In [57]:
groupObject.max()

          Calisan ismi  Maas
Departman
Hukuk           Zeynep   300
Pazarlama      Doğukan   250
Yazılım         Mehmet   150

In [58]:
groupObject.describe()

           Maas
          count   mean        std    min     25%    50%     75%    max
Departman
Hukuk       2.0  262.5  53.033009  225.0  243.75  262.5  281.25  300.0
Pazarlama   2.0  225.0  35.355339  200.0  212.50  225.0  237.50  250.0
Yazılım     2.0  125.0  35.355339  100.0  112.50  125.0  137.50  150.0

In [61]:
birinciDataFrame = pd.DataFrame({"isim":["Ahmet","Mehmet","Zeynep","Doğukan"],
                                 "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
                                 "Kalori":[100,200,250,150]},index=[0,1,2,3])
ikinciDataFrame = pd.DataFrame({"isim":["Osman","Levent","Atlas","Fatma"],
                                 "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
                                 "Kalori":[150,225,175,350]},index=[4,5,6,7])
ucuncuDataFrame = pd.DataFrame({"isim":["Ayşe","Mahmut","Duygu","Nur"],
                                 "Spor":["Koşu","Yüzme","Badminton","Tenis"],
                                 "Kalori":[100,125,375,250]},index=[8,9,10,11])

In [68]:
birinciDataFrame

      isim       Spor  Kalori
8     Ayşe       Koşu     100
9   Mahmut      Yüzme     125
10   Duygu  Badminton     375
11     Nur      Tenis     250

In [69]:
ikinciDataFrame

     isim       Spor  Kalori
4   Osman       Koşu     150
5  Levent      Yüzme     225
6   Atlas       Koşu     175
7   Fatma  Basketbol     350

In [70]:
ucuncuDataFrame

      isim       Spor  Kalori
8     Ayşe       Koşu     100
9   Mahmut      Yüzme     125
10   Duygu  Badminton     375
11     Nur      Tenis     250

## concatenation

In [71]:
pd.concat([birinciDataFrame,ikinciDataFrame,ucuncuDataFrame])

       isim       Spor  Kalori
0     Ahmet       Koşu     100
1    Mehmet      Yüzme     200
2    Zeynep       Koşu     250
3   Doğukan  Basketbol     150
4     Osman       Koşu     150
5    Levent      Yüzme     225
6     Atlas       Koşu     175
7     Fatma  Basketbol     350
8      Ayşe       Koşu     100
9    Mahmut      Yüzme     125
10    Duygu  Badminton     375
11      Nur      Tenis     250

In [72]:
pd.concat([birinciDataFrame,ikinciDataFrame,ucuncuDataFrame],axis=1) # Kolon birleştirme

,isim,Spor,Kalori,isim,Spor,Kalori,isim,Spor,Kalori
0,Ahmet,Koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,Yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,Koşu,250.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Doğukan,Basketbol,150.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,Koşu,150.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,Yüzme,225.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,Koşu,175.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,Basketbol,350.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayşe,Koşu,100.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,Yüzme,125.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,375.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,250.0

## Merge

In [76]:
mergeSozluk1 = {"isim":["Ahmet","Mehmet","Zeynep","Doğukan"],"Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

In [77]:
mergeSozluk2 = {"isim":["Ahmet","Mehmet","Zeynep","Doğukan"],"Kalori":[100,200,250,150]}

In [80]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [81]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [82]:
mergeSonuc = pd.merge(mergeDataFrame1,mergeDataFrame2,on="isim")

In [83]:
mergeSonuc

      isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     250
3  Doğukan  Basketbol     150

In [84]:
maasSozluk = {"isim": ["Doğukan","Zeynep","Ahmet","Mehmet"],
              "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas":[200,300,400,500]
             }

In [85]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [86]:
maasDataFrame

      isim  Departman  Maas
0  Doğukan    Yazılım   200
1   Zeynep      Satış   300
2    Ahmet  Pazarlama   400
3   Mehmet    Yazılım   500

In [87]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [88]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [89]:
maasDataFrame["Departman"].nunique()

3

In [90]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [92]:
def bruttenNete(maas):
   return maas *0.66

In [93]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [94]:
maasDataFrame.isnull()

    isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [95]:
maasDataFrame.isna() # NaN Değer var mı ?

    isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [101]:
yeniBirVeri = {"Karakter Sınıfı":["South Park","Simpson","South Park","Simpson","Simpson"],
               "Karakter Ismi" : ["Cartman","Homer","Kenny","Bart","Bart"],
               "Karakter Yas":[9,10,50,20,10]
              }

In [102]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [103]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1         Simpson         Homer            10
2      South Park         Kenny            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [110]:
karakterDF.pivot_table(values = "Karakter Yas", index=["Karakter Sınıfı", "Karakter Ismi"],aggfunc=sum)

C:\Users\Doğukan\AppData\Local\Temp\ipykernel_10652\2126558916.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "Karakter Yas", index=["Karakter Sınıfı", "Karakter Ismi"],aggfunc=sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    10
South Park      Cartman                   9
                Kenny                    50